Console.WriteLine("Task 34");
// Задайте массив заполненный случайными положительными трехзначными числами.
// Напишите программу, которая покажет количество четных чисел в массиве.
// [345, 897, 568, 234] -> 2



Console.WriteLine("\nTask 36");
// Задайте одномерный массив, заполненный случайными числами.
// Найдите сумму элементов, стоящих на нечетных позициях.
// [3, 7, 23, 12] -> 19
// [-4, -6, -89, 6] -> 0


Console.WriteLine("\nTask 38");
// Задайте массив вещественных чисел. Найдите разницу между
// максимальным и минимальным элементов массива.
// [3, 7, 22, 2, 78] -> 76
// NB: вещественные числа, это плавающие числа типа double.